app/views/users/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 5]]
---

<% @user.products.each do |product|%>