app/controllers/orders_controller.rb

    def order_details
        @user = current_user
        @order = Order.find(params[:order_id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]