app/controllers/products_controller.rb

  def index
    # if params[:q] == nil || params[:q] == ""
      @products = Product.all
---
SELECT "products".* FROM "products"

  def show
    if current_user
      @user = current_user
    end
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
    @product.user = current_user
    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "stock_count", "user_id", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def find_product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]