app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest") VALUES (?, ?)  [["name", "Steven"], ["password_digest", "$2a$04$FyizldhNqHnBeT.W9hKV6.6UP7rjY8e/L6GnuM0sIGyenLDV2QxI6"]]