app/views/products/_form.html.erb

SELECT "tags".* FROM "tags"
---
        <label for="tag">
        <%= f.collection_select :tag_ids, Tag.all, :id, :name, :class => "btn btn-danger dropdown-toggle"%>