app/views/products/checkout.html.erb

<%@basket.each do |item|%>
    <%product = Product.find(item[:product_id])%>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]